app/views/manager/add_staff.erb

<% if a.m_id != @uid %>
<%  u=User.find(a.s_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]