app/views/manager/read_staff.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
<% if a.m_id == @uid %>
<%  u=User.find(a.s_id) %>