app/controllers/manager_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
	def home_page
		@uid=session[:id]
		@user=User.find(@uid)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@uid=session[:id]
		@user=User.find(@uid)

SELECT "assocs".* FROM "assocs"
---
	def add_staff
	# SHOW ALL THE STAFF THAT ARE UNASSIGNED TO MANAGERS and add
		@uid=session[:id]
		@as=Assoc.all()

SELECT "assocs".* FROM "assocs" WHERE "assocs"."s_id" IS NULL LIMIT 1
UPDATE "assocs" SET "s_id" = ?, "updated_at" = ? WHERE "assocs"."id" = 1  [["s_id", nil], ["updated_at", Wed, 12 Feb 2014 23:51:17 UTC +00:00]]
---
	def add_staff_helper
			@as=Assoc.find_by_s_id(params[:sid])
			if(!@as.nil?)
			Assoc.update(@as.id,:m_id=>session[:id], :s_id=>params[:sid])

SELECT "assocs".* FROM "assocs"
---
	def read_staff
	# show all the staff that are assigned to this manager
		@uid=session[:id]
		@as=Assoc.all()