app/controllers/staff_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def home_page
	@uid=session[:id]
	@user=User.find(@uid)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "staff12@locbox.com"], ["updated_at", Wed, 12 Feb 2014 23:01:50 UTC +00:00]]
---
	def edit
		@uid=session[:id]
		@user=User.find(@uid)
		if request.post?
			if(!(params[:name].nil? || params[:email].nil?))
				User.update(@user.id,:name=>params[:name],:email =>params[:email])