app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = 'staff1' LIMIT 1
---
	def login
		if request.post?
			@user=User.find_by_name(params[:name])

SELECT "users".* FROM "users" WHERE "users"."name" = 'staff1' LIMIT 1
INSERT INTO "users" ("created_at", "email", "memtype", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 12 Feb 2014 22:09:44 UTC +00:00], ["email", "staff1@locbox.com"], ["memtype", "s"], ["name", "staff1"], ["updated_at", Wed, 12 Feb 2014 22:09:44 UTC +00:00]]
INSERT INTO "assocs" ("created_at", "s_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 12 Feb 2014 23:28:32 UTC +00:00], ["s_id", 1], ["updated_at", Wed, 12 Feb 2014 23:28:32 UTC +00:00]]
---
	def create
		if request.post?
			@us=User.new
			@as=Assoc.new
		 	@u=User.find_by_name(params[:name])
		 	if(@u.nil?)
		 		@us.name=params[:name]
		 		@us.email=params[:email]
		 		@us.memtype='s'
		 		@us.save!
		 		@as.s_id=@us.id
		 		@as.save!